function my_prompt() {
  let win = document.createElement("div");
  win.style.cssText = `width: 90%;height: 20%; border: 2px blue solid;position: absolute;top: 20px;margin: auto; background: white;text-align: center;padding-top: 30px;`;
  win.innerHTML = `<input id="my_in"><br><button id="canc">cancel</button> <button id="ok">ok</button>`;
  document.querySelector("body").appendChild(win);
  win.onclick = (e) => {
    let btn = e.target;
    if (btn.tagName == "BUTTON") {
      if (btn.innerText == "ok") {
        alert(document.querySelector("#my_in").value);
        win.remove();
      } else {
        alert(null);
        win.remove();
      }
    }
  }
}

А — Ꭿ 凡 Ꮨ ₳ Ǻ ǻ α ά Ά ẫ Ắ ắ Ằ ằ ẳ Ẵ ẵ Ä Ą ą ǻ å â ã ā Λ λ Α ẫ ª â Ã Æ ä Ắ Ā ā ắ Å à Ά ά Ä Ằ Ǻ ǻ Λ ă ằ À â á Á ẳ Ą а ǽ

๖ۣۣۜB — ℬ Ᏸ β ฿ ß Ђ ᗷ ᗸ ᗹ ᗽ ᗾ ᗿ Ɓ ƀ ხ 方 ␢ Ꮄ

๖ۣۣۜC — ☾ ℭ ℂ Ç ¢ ç Č ċ Ċ ĉ ς Ĉ ć Ć č Ḉ ḉ ⊂ Ꮸ ₡ ¢ Ç ĉ ć ς Ḉ č ċ € Ç Ć ¢ ć ç ς Ĉ с ĉ Ċ :copyright: ċכ Č

๖ۣۣۜD — ᗫ Ɗ Ď ď Đ đ ð ∂ ₫ ȡ

๖ۣۣۜE — ℯ ໂ  £ Ē ℮ ē Ė ė Ę ě Ě ę Έ ê ξ Ê È € É ∑ Ế Ề Ể Ễ é è ع Є є έ ε

๖ۣۣۜF — ℱ ₣ ƒ ∮ Ḟ ḟ ჶ ᶂ φ

๖ۣۣۜG — Ꮹ Ꮆ ℊ Ǥ ǥ Ĝ ĝ Ğ ğ Ġ ġ Ģ ģ פ ᶃ ₲

๖ۣۣۜH — ℍ ℋ ℎ ℌ ℏ ዙ Ꮵ Ĥ Ħ ħ Ή ♅ 廾 Ћ ђ Ḩ Һ ḩ ң

๖ۣۣۜI — ℐ ℑ ί ι Ï Ί Î ì Ì í Í î ϊ ΐ Ĩ ĩ Ī ī Ĭ ĭ İ į Į Ꭵ

๖ۣۣۜJ — ჟ Ĵ ĵ ᶖ ɉ

๖ۣۣۜK — ₭ Ꮶ Ќ k ќ ķ Ķ Ҝ ҝ ﻸ ᶄ

๖ۣۣۜL — ℒ ℓ Ŀ ŀ £ Ĺ ĺ Ļ ļ λ ₤ Ł ł ľ Ľ Ḽ ḽ ȴ Ꮭ ￡ Ꮑ Λ

๖ۣۣۜM — ℳ ʍ ᶆ Ḿ ḿ  ᗰ ᙢ 爪  ₥

๖ۣۣۜN — ℕ η ñ ח Ñ ή ŋ Ŋ Ń ń Ņ ņ Ň ň ŉ ȵ ℵ ₦

๖ۣۣۜO — ℴ ტ ٥ Ό ó ό σ ǿ Ǿ Θ ò Ó Ò Ô ô Ö ö Õ õ ờ ớ ọ Ọ ợ Ợ ø Ø Ό Ở Ờ Ớ Ổ ổ Ợ Ō ō

๖ۣۣۜP — ℙ ℘ þ Þ ρ Ꭾ Ꮅ 尸 Ҏ ҏ ᶈ ₱ ☧ ᖘ ק ァ

๖ۣۣۜQ — ℚ q Q ᶐ Ǭ ǭ ჹ

๖ۣۣۜR — ℝ ℜ ℛ ℟ ჩ ᖇ ř Ř ŗ Ŗ ŕ Ŕ ᶉ Ꮢ 尺

๖ۣۣۜS — Ꮥ Ṧ ṧ ȿ ى § Ś ś š Š ş Ş ŝ Ŝ ₰ ∫ $ ֆ

๖ۣۣۜT — ₸ † T t τ ΐ Ţ ţ Ť ť ŧ Ŧ ィ 干 Ṫ ṫ ナ Ꮏ Ꮖ テ ₮

๖ۣۣۜU — ∪ ᙀ Ũ ⋒ Ủ Ừ Ử Ữ Ự ύ ϋ Ù ú Ú ΰ ù Û û Ü ử ữ ự Џ ü ừ Ũ ũ Ū ū Ŭ ŭ ų

๖ۣۣۜV. v \/ ^

๖ۣۣۜW. Ŵ Ш Щ Ẁ ẁ Ẃ ẃ Ẅ ẅ ω ώ ш щ Ẁ ẁ Ẃ ẃ

๖ۣۣۜX. χ x Ẍ

๖ۣۣۜY — ɣ Ꭹ Ꮍ Ẏ ẏ ϒ ɤ ￥ り

๖ۣۣۜZ — ℤ ℨ ჳ 乙 Ẑ ẑ ɀ Ꮓ

Символы

█ ▆ ▅ ▃ ▂ Очень пригодится) ▂ ▃ ▅ ▆ █

▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄

✃ ✄ ✆ ✇    ✎  ✐ ✑  ✓  ✕  ✗ ✘ ✙ ✚ ✛ ✜  ✞ ✟ ✠  ✢ ✣ ✤ ✥ ✦ ✧ ✩ ✪ ✫ ✬ ✭ ✮ ✯ ✰ ✱ ✲   ✵ ✶ ✷ ✸ ✹ ✺ ✻ ✼ ✽ ✾ ✿ ❀ ❁ ❂ ❃  ❅ ❆  ❈ ❉ ❊ ❋ ❍ ❏ ❐ ❑ ❒ ❖ ❘ ❙ ❚ ❛ ❜ ❝ ❞ ❡ ❢   ❥ ❦ ❧ ❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ➀ ➁ ➂ ➃ ➄ ➅ ➆ 7 ➇ ➈ ➉ ➊ ➋ ➌ ➍ ➎ ➏ ➐ ➑ ➒ ➓ ➔ ➘ ➙ ➚ ➛ ➜ ➝ ➞ ➟ ➠  ➢ ➣ ➤ ➥ ➦ ➧ ➨ ➩ ➪ ➫ ➬ ➭ ➮ ➯ ➱ ➲ ➳ ➴ ➵ ➶ ➷ ➸ ➹ ➺ ➻ ➼ ➽

虎の子

½ ⅓ ⅔ ⅛ ⅜ ⅝ ⅞

← ↑ → ↓ :left_right_arrow:   ⇐ ⇒:

:tm:

☼ ☽ ★ ☆ ☾

♔ ♕ ♖ ♗ ♘ ♙ ♙ ♚ ♛ ♜ ♝ ♞ ♟

:spades: :clubs: :hearts: :diamonds: 牡 マ キ グ ナ ル フ ァ 系 路 克 瑞 大 阪 市 立 学

鎰 命 85; ャ マ 能 力 ϒ 人 は 妻 ス テ ィ 要 望 通

り 玉 宏 ¥ サ 丹 谷 Ѫ 灯 影 伝 鶐:

Ð » ѓ ўЏ

:copyright: ت ۩۞۩ ͡๏̯͡๏ :left_right_arrow:   † ● • ˜ ° ღ ஐ █  ▄▀▄▀ ψ  ☏ ⊇

◘  ▄ TM ๑۩۩๑ ۩ ۞ ¤ :registered: ╡ ╬ ┼ √ ╪ ═ ► ツ 1 ๖ۣۜG ¯ ⊆

シ ټ ン ₪ ▼ ℮ ਠ ▲ ̃ ഊ ๑ ○ ± ╞ ☻ § ╚ ╣ ₣ Σ Ω ϟ

¢ ø ¶ ◄ ╔ ╦ ╟ ╩ ﻸ の ║ ن ╝ ╗ א ◙ 、 ☜ ☞ ʎ ▿ இ ㋛

❖ € ک ✿ ↨ ∆ ۵   ⋆ 3 o  ‰ § Џ ȋ þ Ђ Þ Ł ł

さ む ░░░ ▒ ▓ ٭ ր ┘ ┌ Գ  ▌ ∟ ハ ≈ 1 ❶ ❼ ֆ    Ѡ

∆ ∑ ∫ ■ σ

☭ Ѽ a ➳   ❢ 2;  യ ✁ ✄

⎛⎳oעе ⎞ ⎲⎞ ⎞

✓ ☐  ☒ ✪ ★ ☆ 〠    ☊  ☤ ☬ ☫  ☨  ☧ ☥ 〄 √ιק ҳ̸Ҳ̸ҳ ..ιllιlι.ιl.

๏̯͡๏ &

.ιllιlι.ιl..ιllιlι.ιl.

∞

Ａ Ｂ Ｃ Ｄ Ｅ Ｆ Ｇ Ｈ Ｉ Ｊ Ｋ Ｌ Ｍ Ｎ Ｏ Ｐ Ｑ Ｒ Ｓ Ｔ Ｕ Ｖ Ｗ Ｘ Ｙ Ｚ

ⓐ ⓑ ⓒ ⓓ ⓔ ⓕ ⓖ ⓗ ⓘ ⓙ ⓚ ⓛ ⓜ ⓝ ⓞ ⓟ ⓠ ⓡ ⓢ ⓣ ⓤ ⓥ ⓦ ⓧ ⓨ ⓩ

Маленькие буквы

ᴀ ʙ ᴄ ᴅ ᴇ ғ ɢ ʜ ɪ ᴊ ᴋ ʟ ᴍ ɴ ᴏ ᴘ ǫ ʀ s ᴛ ᴜ ᴠ ᴡ x ʏ ᴢ

ᵃ ᵇ ᶜ ᵈ ᵉ ᶠ ᵍ ʰ ʲ ᵏ ˡ ᵐ ᵑ ᵒ ᵖ ᵠ ʳ ˢ ᵗ ᵘ ᵛ ʷ ˣ ʸ ᶻ ᵔ ᵕ

ᴬ ᴮ ᴰ ᴱ ᴳ ᴴ ᴶ ᴸ ᴷ ᴹ ᴺ ᴼ ᴾ ᴿ ᵀ ᵁ ᵂ

⁰ ¹ ² ³ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ⁽ ⁾ ⁿ

₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₍ ₎

ᵖ ᵗ ᵘ ᵙ ᵚ ᵛ ᵜ ᵝ ᵞ ᵟ ᵠ ᵡ ᵢ ᵣ ᵤ ᵥ ᵦ ᵧ ᵨ ᵩ ᵪ ᶛ ᶜᶝ ᶞ ᶟ ᶠ ᶡ ᶢ ᶣ ᶤ ᶥ ᶦ ᶻ ᶼ ᶽ ᶾ ᶿ

:clubs: ★ ★ ◕  ღ ┴═╦╗ ۞ ۩ ˙·٠●• ▼ ° დ √ ✰  ( ͡° ͜ʖ ͡°) ツ ☆ ◘ ○ :hearts: ♬ ♫ ♪ ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂ ○ :diamonds: † ● 工 ﾚ o √ 乇 ㄚ ◯ ∪ ✰ ✰ :hearts: ┼ :tm: ★   ▬ ◊ ☭ Ѽ  :registered:   ┐ :spades: :tm: :registered:

☻ :diamonds: ↓ :copyright: ¶ € 떰  Ω •°*”˜ •°•• ★, ♪ ▂ ▃ ▄ ▆ ▒     ๏̯͡ 斯坦尼斯会文 社 ═╬ ╬═ ▀▄ ▀▄ ▀▄ ▀▄ ۞ இ :registered: √ ๑ ¤  ツ ●• ♡ :hearts:   ₪ ø ஐ  ˜”*°•..•°*”˜ ש ت ˙˙· . ૐ ╬╬╬ ❖❖❖❖ ‡  ╬ ✿ ◊ ❀ Ɣ♪ ☚ ☛ ☛ ☜ ☜  ☞ ☟      ★ ☆ ☇ ☡   ☤ ☥  ☧ ☨ ☩ ☫ ☬ ☭    ☽ ☾ ☿  ♁  ♃ ♄ ♅ ♆ ♇           ♔ ♕ ♖ ♗ ♘ ♙ ♚ ♛ ♜ ♝ ♞ ♟ ♡  ♢  :clubs: ◿ ♤ ♤ :hearts: :hearts: :diamonds: :diamonds: ♧ ♧  ♩ ♩ ♪ ⒋ ♬ ♭ ♮ ♲  卍 ↯ ✄  ͡๏̯͡๏ :left_right_arrow:   † ● • ˜ ° ψ  ☏ ⊇ ◘  ▄ :tm: ¤ :registered: ╡ ╬ ┼ √ ╪ ═ ► ツ ¹ ๖ ン ₪ ▼ ਠ ▲ ̃ ഊ ๑ ○ ¢ ø ﻸ の ║ ن ╝ ╗ א ◙ 、 ☞ ʎ ▿ ㋛ ❖ € ک ✿ ↨ ∆ ۵  ³ º  • █ ▌ ☼ ▒ ๏̯͡๏ ▬ ░░░ ▒ ▓ ٭

❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ➀ ➁ ➂ ➃ ➄ ➅ ➆ ➇ ➈ ➉♡♡♡ ✽ ✾ ✿ ❀ ❁ ❂ ❃  ❅ ❆  ❈ ❉ ❊ ❋ ソ ッ ヅ ツ ゾ シ ジ ｯ ﾂ ｼ ﾝ ㋛ ☻ ๏̯͡๏ :left_right_arrow:   ←  ↑  →  ↓  ˿ ≪ « » ↨ ⇦ ⇧ ⇨ ⇩⇐⇑ ⇒⇓ ⇔ ⇕ ⇖ ⇗ ⇘ ⇙ ⇚ ⇛ ⇜ ⇝ ⇄ ⇅